# Task 1
print('Задание 1')
print('Я люблю клуб Эчпочмак!')

# Task 2
print('Задание 2')
chislo1 = input("Введите целое число: ")
chislo2 = input("Введите дробное число: ")
print(f'А вот и сумма: {int(chislo1)+float(chislo2)}')

# Task 3
print('Задание 3')
print(' - Ооо, ченазес, сюда-сюдаа')
name = input(" - Я не ченазес, меня зовут (введите имя): ")
print(f' - Ну привет, {name}! Есть чо мелочью погреметь до завтра?')

# Task 4
print('Задание 4')
band = input("Напиши, какая твоя любимая музыкальная группа/исполнитель: ")
track = input("И какой у них лучший трек: ")
print('Секунду, мы конкатинируем... \nИтак, твоя любимая песня:')
print(band+" - "+track)

# Task 5
print('Задание 5')
length = float(input("Длина стороны квадрата: "))
print(f'Периметр: {4*length}\nПлощадь: {length*length}')

print('Спасибо за внимание!:)')